src/AccumulationRegisters/МатериалыКСписанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>МатериалыКСписанию</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<Comment>Денежные средства</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
					<Comment>Ввод остатков</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносУчредителя</Name>
					<Comment>Взнос учредителя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОшибочнойОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСЛицевогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВКассу</Name>
					<Comment>Для фин. операций. Отправка банком ден. средств в организацию</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаДивидендовУчредителю</Name>
					<Comment>ВыплатаДивидендовУчредителю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачислениеСертификата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеМеждуСкладами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещенияМеждуСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСкладу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассы</Name>
					<Comment>Для фин. операций. Поступление фиксация поступления ден. средств в банк </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтЭквайера</Name>
					<Comment>Поступление от эквайера</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаНаличныхВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеРозничнойВыручкиИзОперационнойКассы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассыПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаРозничнойВыручкиВКассуПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВОперационнуюКассу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Comment>Денежные средства на лицевом счете</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводыВПути</Name>
					<Comment>Для фин. операций передачи денег из организации в банк</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
					<Comment>Для СБП и ссылок на оплату</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыКассовойСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыКассовойСмены</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытаЧекиЗаархивированы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/КассоваяСмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>КассоваяСмена</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусыКассовойСмены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКассовойСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/СписаниеМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СписаниеМатериалов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.МатериалыКСписанию</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиСебестоимость</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПродажи</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Прием</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonModules/РозничныеПродажи/Ext/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция, возвращает последнюю кассовую смену.
//
Функция ПолучитьПоследнююКассовуюСмену(Касса) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КассоваяСмена.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Проведен
	|	И КассоваяСмена.Касса = &Касса
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассоваяСмена.НачалоКассовойСмены УБЫВ");
	
	Запрос.УстановитьПараметр("Касса", Касса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	
КонецФункции

// Функция - Получить текущую открытую кассовую смену.
//
// Параметры:
//  Касса	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТекущуюОткрытуюКассовуюСмену(Касса) Экспорт
	
	Возврат Документы.КассоваяСмена.ПолучитьТекущуюОткрытуюКассовуюСмену(Касса);

КонецФункции

// Функция возвращает структуру, характеризующую состояние последней кассовой смены по кассе ККМ.
//
Функция ПолучитьСостояниеКассовойСмены(Касса) Экспорт
	
	Возврат Документы.КассоваяСмена.ПолучитьСостояниеКассовойСмены(Касса);	
	
КонецФункции

// Функция проверяет состояние кассовой смены на дату. Если смена не открыта - возвращаеся описание ошибки.
//
Функция СменаОткрыта(КассоваяСмена, Дата, ОписаниеОшибки = "") Экспорт
	
	Возврат Документы.КассоваяСмена.СменаОткрыта(КассоваяСмена, Дата, ОписаниеОшибки);	

КонецФункции

// Функция - Разрешено использование кассовой смены
//
// Параметры:
//  Касса	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ДоступностьИспользованияКассовойСмены(Касса) Экспорт
	
	Возврат ЗначениеЗаполнено(Касса.ВнешнееОборудование) 
			И Касса.ИспользоватьБезПодключенияОборудования = Ложь;	
			
КонецФункции        

// Функция выполняет открытие кассовой смены.
//
Функция ОткрытьКассовуюСмену(Касса, ОписаниеОшибки = "") Экспорт
	
	Результат = Документы.КассоваяСмена.ОткрытьКассовуюСмену(Касса, ОписаниеОшибки);		
	
	Если Результат = Истина Тогда		
		ОткрытьСменыНаСовместныхКассах(Касса);
	КонецЕсли;
	
	Возврат Результат;   	
	
КонецФункции

// Процедура - Открыть смены на совместных кассах
//
// Параметры:
//  Кассса	 - 	 - 
//
Процедура ОткрытьСменыНаСовместныхКассах(Кассса)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Кассы.Ссылка КАК Касса
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|ГДЕ
	|	Кассы.ВнешнееОборудование = &ВнешнееОборудование
	|	И Кассы.ПометкаУдаления = ЛОЖЬ
	|	И НЕ Кассы.Ссылка = &ИсключитьКассу
	|	И Кассы.ИспользоватьБезПодключенияОборудования = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("ВнешнееОборудование", Кассса.ВнешнееОборудование);
	Запрос.УстановитьПараметр("ИсключитьКассу"     , Кассса);
	
	Кассы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Касса");
	
	Для Каждого КассаС ИЗ Кассы Цикл
		
		ОписаниеОшибки = Неопределено;
		
		Результат = Документы.КассоваяСмена.ОткрытьКассовуюСмену(КассаС, ОписаниеОшибки);				
		
		Если Не Результат Тогда
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'При открытии смены на кассе %1 произошла ошибка. Смена не открыта.
                                             |Дополнительное описание: %2'; en = 'An error occurred while opening the shift at the %1 cashbox. Shift is not open.
                                             |Additional description: %2'"), КассаС, ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры
                                                
// Процедура выполняет закрытие кассовой смены.
//
Функция ЗакрытьКассовуюСмену(Касса, ОписаниеОшибки = "", ВремяЗакрытияСмены = Неопределено) Экспорт
	
	Возврат Документы.КассоваяСмена.ЗакрытьКассовуюСмену(Касса, ОписаниеОшибки, ВремяЗакрытияСмены);
	
КонецФункции

// Функция - Сформировать выемку из кассы
//
// Параметры:
//  Период			 - 	 - 
//  Касса			 - 	 - 
//  СуммаВыемки		 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьВыемкуИзКассы(СтруктураДанных, ОписаниеОшибки = "") Экспорт
	
	ДокВыемки      = Неопределено;                  
	ДокПоступления = Неопределено;
	Касса 		   = СтруктураДанных.Касса;
	СуммаВыемки    = СтруктураДанных.СуммаДокумента;		
	ВыемкаИзКассы  = Касса.ВыемкаИзКассы;                              	
	
	КассаВыемки                  = Касса.КассаДляСдачиВыручки;		
	ФормироватьПоступлениеВыемки = Касса.ЗавершатьАвтоматическиОперацииВемкиВнесения;
	
	ОстатокВКассе                = ДенежныеСредстваСервер.ПолучитьОстаткоДенежныхСредств(ТекущаяДатаСеанса(), СтруктураДанных.Касса);
	
	Если ОстатокВКассе < СтруктураДанных.СуммаДокумента Тогда
		ОписаниеОшибки = НСтр("ru= 'Остаток средств в кассе меньше запрошенной выемки!';en= 'The cash balance is less than the requested recess!'");
		Возврат Ложь;
	КонецЕсли;
	
	Если ФормироватьПоступлениеВыемки = Истина И НЕ ЗначениеЗаполнено(КассаВыемки) Тогда
		ОписаниеОшибки = НСтр("ru= 'В операционной кассе не указана касса поступления выручки!';en= 'The operating cash desk does not indicate the cash desk of the revenue!'");
		Возврат Ложь;
	КонецЕсли;
	
	Попытка    
		Если ВыемкаИзКассы = Перечисления.ВидыОпераций.СдачаРозничнойВыручкиВКассуПредприятия Тогда
			СтруктураДанных.Вставить("ВидОперации", Перечисления.ВидыОпераций.СдачаРозничнойВыручкиВКассуПредприятия);
		ИначеЕсли ВыемкаИзКассы = Перечисления.ВидыОпераций.СдачаНаличныхВБанк Тогда                              
			СтруктураДанных.Вставить("ВидОперации", Перечисления.ВидыОпераций.СдачаНаличныхВБанк);
		КонецЕсли;
		
		ДокОбъект = Документы.СписаниеДенежныхСредств.СоздатьДокумент();			
		ДокОбъект.Заполнить(СтруктураДанных);
		ДокОбъект.Дата = ТекущаяДатаСеанса();
		ДокОбъект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные; 			
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ДокВыемки = ДокОбъект.Ссылка;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();		
	КонецПопытки;
	
	// Формируем автоматическое поступление выручки из опер. кассы
	Если ФормироватьПоступлениеВыемки = Истина Тогда
		
		ДокОбъект    = Документы.ПоступлениеДенежныхСредств.СоздатьДокумент();
		
		СтруктураЗап = Новый Структура;
		СтруктураЗап.Вставить("ТипДенежныхСредств", Перечисления.ТипыДенежныхСредств.Наличные);
		СтруктураЗап.Вставить("ВидОперации"       , Перечисления.ВидыОпераций.ПоступлениеРозничнойВыручкиИзОперационнойКассы);
		СтруктураЗап.Вставить("Касса"             , КассаВыемки);
		СтруктураЗап.Вставить("СуммаДокумента"    , СуммаВыемки);
		
		ДокОбъект.Заполнить(СтруктураЗап);
		
		ДокОбъект.Дата = ТекущаяДатаСеанса();
		
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ДокПоступления = ДокОбъект.Ссылка;
	КонецЕсли;   	
	
	Возврат Новый Структура("ДокВыемки, ДокПоступления", ДокВыемки, ДокПоступления);
	
КонецФункции

// Функция - Сформировать поступление в операционную кассу изкассы предприятия
// (надо решить по поводу кассыпредприятия нужна ли она в стоме)
Функция СформироватьПоступлениеВОперационнуюКассуИзкассыПредприятия(Период, СтруктураДанных, ОписаниеОшибки = "") Экспорт

	Касса 			 = СтруктураДанных.Касса;         
	СуммаПоступления = СтруктураДанных.СуммаДокумента;
	Комментарий		 = СтруктураДанных.Комментарий;
	
	ДокПоступления   = Неопределено;
	ДокВыбытия       = Неопределено;
	КассаВыбытия     = Касса.КассаДляСдачиВыручки;
	ФормироватьВыемкуАвтоматически = Касса.ЗавершатьАвтоматическиОперацииВемкиВнесения;
	
	Если ФормироватьВыемкуАвтоматически = Истина Тогда 
		Если НЕ ЗначениеЗаполнено(КассаВыбытия) Тогда
			ОписаниеОшибки = НСтр("ru= 'В операционной кассе не указана касса предприятия!';en= 'The operating cash desk does not indicate the cash desk of the enterprise!'");
			Возврат Ложь;
		Иначе
			ОстатокВКассе = ДенежныеСредстваСервер.ПолучитьОстаткоДенежныхСредств(Период, КассаВыбытия);
			Если ОстатокВКассе < СуммаПоступления Тогда
				ОписаниеОшибки = НСтр("ru= 'Остаток средств в кассе предприятия меньше запрошенной суммы!';en= 'The balance at the cash desk of the enterprise is less than the requested amount!'");
				Возврат Ложь;
			КонецЕсли;		
		КонецЕсли;	
	КонецЕсли;

	Попытка
		ДокОбъект    = Документы.ПоступлениеДенежныхСредств.СоздатьДокумент();
		СтруктураЗап = Новый Структура;
		СтруктураЗап.Вставить("ТипДенежныхСредств", Перечисления.ТипыДенежныхСредств.Наличные);
		СтруктураЗап.Вставить("ВидОперации"       , Перечисления.ВидыОпераций.ПоступлениеИзКассыПредприятия);
		СтруктураЗап.Вставить("Касса"             , Касса);
		СтруктураЗап.Вставить("СуммаДокумента"    , СуммаПоступления);		
		Если ЗначениеЗаполнено(Комментарий) Тогда
			СтруктураЗап.Вставить("Комментарий"   , Комментарий);			 
		КонецЕсли;
		
		ДокОбъект.Заполнить(СтруктураЗап);
		ДокОбъект.Дата = ТекущаяДатаСеанса(); 		
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ДокПоступления = ДокОбъект.Ссылка;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Если ФормироватьВыемкуАвтоматически = Истина Тогда
		
		ДокОбъект    = Документы.СписаниеДенежныхСредств.СоздатьДокумент();
		СтруктураЗап = Новый Структура;
		СтруктураЗап.Вставить("ТипДенежныхСредств", Перечисления.ТипыДенежныхСредств.Наличные);
		СтруктураЗап.Вставить("ВидОперации"       , Перечисления.ВидыОпераций.ВыбытиеВОперационнуюКассу);
		СтруктураЗап.Вставить("Касса"             , КассаВыбытия);
		СтруктураЗап.Вставить("СуммаДокумента"    , СуммаПоступления);
		Если ЗначениеЗаполнено(Комментарий) Тогда
			СтруктураЗап.Вставить("Комментарий"   , Комментарий);			 
		КонецЕсли;
		
		ДокОбъект.Заполнить(СтруктураЗап);
		ДокОбъект.Дата = ТекущаяДатаСеанса();
		
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ДокВыбытия = ДокОбъект.Ссылка;	
	КонецЕсли;
	
	Возврат Новый Структура("ДокПоступления, ДокВыбытия", ДокПоступления, ДокВыбытия);
	
КонецФункции

// Процедура - Записать номер чека в документ
//
// Параметры:
//  ДокументСсылка	 - 	 - 
//  НомерЧека		 - 	 - 
//
Процедура ЗаписатьНомерЧекаВДокумент(ДокументСсылка, НомерЧека) Экспорт
	
	Если ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("НомерЧекаККМ", ДокументСсылка.Метаданные()) = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ДокОбъект = ДокументСсылка.ПолучитьОбъект();
	ДокОбъект.НомерЧекаККМ = НомерЧека;
	ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	 
КонецПроцедуры

// Функция - Получить кассы доступные для оплаты
// 
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
//  Сотрудник			 - 	 - 
//  РабочееМесто		 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПолучитьКассыДоступныеДляОплаты(Кассы, РабочееМесто, ЕслиЕстьФРТоТолькоДоступные = Истина, СтруктурнаяЕдиница = Неопределено) Экспорт
	
	МассивКасс = Новый Массив;
	
	Для Каждого Касса ИЗ Кассы Цикл
		
		КассаДоступнаПоФр = Истина;	
		ФРИспользуется    = ЗначениеЗаполнено(Касса.ВнешнееОборудование) И Касса.ВнешнееОборудование.УстройствоИспользуется = Истина;
		
		Если Касса.ИспользоватьБезПодключенияОборудования = Ложь 
			И ЗначениеЗаполнено(Касса.ВнешнееОборудование)
			И Касса.ВнешнееОборудование.УстройствоИспользуется = Истина
			И Касса.ВнешнееОборудование.РабочееМесто <> РабочееМесто Тогда
			
			КассаДоступнаПоФр = Ложь;
			
		КонецЕсли;
		
		МассивКасс.Добавить(Новый Структура("Касса,ФРИспользуется,КассаДоступна,ИспользуетсяОнлайн", Касса, ФРИспользуется, КассаДоступнаПоФр, Ложь));
		
	КонецЦикла;
	
	Возврат МассивКасс;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//////////////////////////////////////////////////////////////////////////////
// РЕГЛАМЕНТНЫЕ ЗАДАНИЯ
// Процедура выполняет архивирование чеков с регистрацией события в журнале регистрации.
// Вызывается регламентным заданием.
//
Процедура АрхивированиеЧековККМ() Экспорт
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Архивирование чеков'"),
	УровеньЖурналаРегистрации.Информация, , ,
	НСтр("ru = 'Начато регламентное архивирование чеков'"));
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КассоваяСмена.Ссылка КАК КассоваяСмена
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Проведен
	|	И КассоваяСмена.СтатусыКассовойСмены = &СтатусыКассовойСмены";
	
	Запрос.УстановитьПараметр("СтатусыКассовойСмены", Перечисления.СтатусыКассовойСмены.Закрыта);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОписаниеОшибки = "";
		// АрхивацияВыполнена = 
		
		// РозничныеПродажи.ВыполнитьАрхивациюЧековККМ(Выборка.КассоваяСмена, ОписаниеОшибки);
		
		АрхивацияВыполнена = ?(ОписаниеОшибки = "", Истина, Ложь);
		
		Если НЕ АрхивацияВыполнена Тогда
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Архивирование чеков'"),
			УровеньЖурналаРегистрации.Ошибка, , ,
			НСтр("ru = 'Во время регламентного архивирования чеков произошла ошибка.'")
			+ Символы.ПС + ОписаниеОшибки);
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Архивирование чеков'"),
	УровеньЖурналаРегистрации.Информация, , ,
	НСтр("ru = 'Закончено регламентное архивирование чеков'"));
	
КонецПроцедуры // АрхивированиеЧековККМ()

// Функция формирует документы СписаниеМатериалов
//
Функция СформироватьСписаниеМатериалов(КассоваяСмена, ОписаниеОшибки = "") Экспорт
	
	МассивДокументов = Новый Массив;
	Если КассоваяСмена.Касса.АвтоматическоеСписаниеМатериалов Тогда 
		
		ВыборкаМатериалы = ПолучитьВыборкуСписываемыхМатериалов(КассоваяСмена);	
		Пока ВыборкаМатериалы.Следующий() Цикл			
			СписаниеМатериалов = Документы.СписаниеМатериалов.СоздатьДокумент();	
			СписаниеМатериалов.Дата = ТекущаяДата();
			СписаниеМатериалов.СтруктурнаяЕдиница = КассоваяСмена.СтруктурнаяЕдиница;
			Если ТипЗнч(ВыборкаМатериалы.Склад) = Тип("СправочникСсылка.Сотрудники") Тогда 
				СписаниеМатериалов.ВидОперации 	= Перечисления.ВидыОпераций.ПоСотруднику;
			ИначеЕсли ТипЗнч(ВыборкаМатериалы.Склад) = Тип("СправочникСсылка.Склады") Тогда	
				СписаниеМатериалов.ВидОперации = Перечисления.ВидыОпераций.ПоСкладу;
			КонецЕсли;	
			СписаниеМатериалов.Склад			= ВыборкаМатериалы.Склад; 
			СписаниеМатериалов.АвторДокумента	= ПараметрыСеанса.ТекущийПользователь;
			
			ВыборкаПоСкладам = ВыборкаМатериалы.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока ВыборкаПоСкладам.Следующий() Цикл				
				СтрокаЗапасы = СписаниеМатериалов.Запасы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаЗапасы, ВыборкаПоСкладам);
				СтрокаЗапасы.КоличествоУпаковок = СтрокаЗапасы.Количество;				
				СтрокаЗапасы.СтруктурнаяЕдиница = КассоваяСмена.СтруктурнаяЕдиница;
			КонецЦикла;
			СписаниеМатериалов.Записать();
			МассивДокументов.Добавить(СписаниеМатериалов.Ссылка);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МассивДокументов;
	
КонецФункции

// Функция возвращает выборку списываемых материалов
//
Функция ПолучитьВыборкуСписываемыхМатериалов(КассоваяСмена)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МатериалыКСписанию.Период КАК Период,
	|	МатериалыКСписанию.Склад КАК Склад,
	|	МатериалыКСписанию.Услуга КАК Услуга,
	|	МатериалыКСписанию.Материал КАК Номенклатура,
	|	МатериалыКСписанию.Партия КАК Партия,
	|	МатериалыКСписанию.Сотрудник КАК Сотрудник,
	|	МатериалыКСписанию.Клиент КАК Контрагент,
	|	МатериалыКСписанию.ДокументПродажи КАК ДокументПродажи,
	|	МатериалыКСписанию.Количество КАК Количество,
	|	ВложенныйЗапрос.ОкончаниеКассовойСмены КАК ОкончаниеКассовойСмены
	|ИЗ
	|	РегистрНакопления.МатериалыКСписанию КАК МатериалыКСписанию
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
	|			КассоваяСмена.ОкончаниеКассовойСмены КАК ОкончаниеКассовойСмены,
	|			КассоваяСмена.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|			КассоваяСмена.Касса КАК Касса
	|		ИЗ
	|			Документ.КассоваяСмена КАК КассоваяСмена
	|		ГДЕ
	|			КассоваяСмена.Касса = &Касса
	|			И КассоваяСмена.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|			И КассоваяСмена.Ссылка <> &Ссылка
	|		
	|		УПОРЯДОЧИТЬ ПО
	|			КассоваяСмена.Дата УБЫВ) КАК ВложенныйЗапрос
	|		ПО МатериалыКСписанию.СтруктурнаяЕдиница = ВложенныйЗапрос.СтруктурнаяЕдиница
	|			И МатериалыКСписанию.ДокументПродажи.Касса = ВложенныйЗапрос.Касса
	|ГДЕ
	|	МатериалыКСписанию.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ВЫБОР
	|			КОГДА ВложенныйЗапрос.ОкончаниеКассовойСмены ЕСТЬ NULL
	|				ТОГДА МатериалыКСписанию.Период >= &ПериодОт
	|			ИНАЧЕ МатериалыКСписанию.Период > ВложенныйЗапрос.ОкончаниеКассовойСмены
	|		КОНЕЦ
	|	И МатериалыКСписанию.Период <= &ПериодДо
	|	И МатериалыКСписанию.Регистратор ССЫЛКА Документ.Прием
	|
	|УПОРЯДОЧИТЬ ПО
	|	МатериалыКСписанию.Материал.Наименование
	|ИТОГИ ПО
	|	Склад");

	Запрос.УстановитьПараметр("Ссылка"				, КассоваяСмена);			   
	Запрос.УстановитьПараметр("Касса"				, КассоваяСмена.Касса); 				   
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, КассоваяСмена.СтруктурнаяЕдиница); 
	Запрос.УстановитьПараметр("ПериодОт"			, КассоваяСмена.НачалоКассовойСмены); 
	Запрос.УстановитьПараметр("ПериодДо"			, КассоваяСмена.ОкончаниеКассовойСмены); 
	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОТКРЫТИЯ И ЗАКРЫТИЯ КАССОВОЙ СМЕНЫ
     
// Процедура выполняет закрытие кассовой смены.
//
Функция ВыполнитьОперациюЗакрытияКассовойСмены(Касса, ОшибкаПриСнятииZОтчета, ОписаниеОшибки = "") Экспорт
	                                            	
	МассивДокументов = Новый Массив;
	
	Попытка
		
		НачатьТранзакцию();
		
		// Закрытие кассовой смены 	
		КассоваяСмена = ОбщегоНазначенияСтоматология.ВернутьКассуИВыполнитьЗакрытиеСмены(Касса, ОписаниеОшибки);
		Если КассоваяСмена = Неопределено Тогда
			ВызватьИсключение ОписаниеОшибки;
		КонецЕсли;
		
		// Формирование документа СписаниеМатериалов
		МассивСозданных = СформироватьСписаниеМатериалов(КассоваяСмена, ОписаниеОшибки);
		Если МассивСозданных <> Неопределено Тогда 
			Для Каждого ДокСсылка Из МассивСозданных Цикл 
				МассивДокументов.Добавить(ДокСсылка);	
			КонецЦикла;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
		// Выполним попытку проведения документов отчет, в том случае, если транзакция удалась, но по каким-то причинам отчет не провелся.
		Для Каждого ДокументКПроведению Из МассивДокументов Цикл
			Если ЗначениеЗаполнено(ДокументКПроведению.Ссылка) и (НЕ ДокументКПроведению.Проведен) Тогда
				ДокументКПроведениюОбъект = ДокументКПроведению.ПолучитьОбъект();
				Попытка
					ДокументКПроведениюОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
				Исключение
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ """ + ДокументКПроведению + """.");
				КонецПопытки;  				
			КонецЕсли;
		КонецЦикла;
		
	Исключение
		
		ОтменитьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		
	КонецПопытки;
	
	Возврат МассивДокументов;
	
КонецФункции // ВыполнитьОперациюЗакрытияКассовойСмены()
           
//////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ПРОВЕРКИ СОСТОЯНИЯ КАССОВОЙ СМЕНЫ

// Функция возвращает пустую структуру состояния кассовой смены.
//
Функция ПолучитьСтруктуруОписанияКассовойСмены()
	
	СостояниеКассовойСмены = Новый Структура;
	СостояниеКассовойСмены.Вставить("КассоваяСмена");
	СостояниеКассовойСмены.Вставить("НаличностьВКассе");
	СостояниеКассовойСмены.Вставить("НомерКассовойСмены");
	СостояниеКассовойСмены.Вставить("СтатусыКассовойСмены");
	СостояниеКассовойСмены.Вставить("НачалоКассовойСмены");
	СостояниеКассовойСмены.Вставить("ОкончаниеКассовойСмены");
	
	// СостояниеКассовойСмены.Вставить("ДатаИзмененияСтатуса");
	// СостояниеКассовойСмены.Вставить("СменаОткрыта", Ложь);
	
	// Описание реквизитов кассовой смены
	СостояниеКассовойСмены.Вставить("Касса");
	СостояниеКассовойСмены.Вставить("Валюта");
	СостояниеКассовойСмены.Вставить("ВалютаПредставление");
	СостояниеКассовойСмены.Вставить("СтруктурнаяЕдиница");
	
	Возврат СостояниеКассовойСмены;
	
КонецФункции // ПолучитьСтруктуруОписанияКассовойСмены()

// Функция возвращает структуру, характеризующую состояние последней кассовой смены по кассе ККМ.
//
Функция ПолучитьСостояниеКассовойСмены_(Касса) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КассоваяСмена.Номер КАК НомерКассовойСмены,
	|	КассоваяСмена.Ссылка КАК КассоваяСмена,
	|	КассоваяСмена.СтатусыКассовойСмены КАК СтатусыКассовойСмены,
	|	КассоваяСмена.Касса КАК Касса,
	|	ВЫБОР
	|		КОГДА КассоваяСмена.СтатусыКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СменаОткрыта,
	|	ВЫБОР
	|		КОГДА КассоваяСмена.СтатусыКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|			ТОГДА КассоваяСмена.НачалоКассовойСмены
	|		ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены
	|	КОНЕЦ КАК ДатаИзмененияСтатуса,
	|	ЕСТЬNULL(ДенежныеСредства.СуммаОстаток, 0) КАК НаличностьВКассе,
	|	КассоваяСмена.Касса.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредства.Остатки(, БанковскийСчетКасса = &Касса) КАК ДенежныеСредства
	|		ПО КассоваяСмена.Касса = ДенежныеСредства.БанковскийСчетКасса
	|ГДЕ
	|	КассоваяСмена.Проведен
	|	И КассоваяСмена.Касса = &Касса
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассоваяСмена.Дата УБЫВ,
	|	КассоваяСмена УБЫВ";
	
	Запрос.УстановитьПараметр("Касса", Касса);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ОписаниеКассовойСмены = ПолучитьСтруктуруОписанияКассовойСмены();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОписаниеКассовойСмены, Выборка);
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Валюты.Ссылка КАК Валюта,
		|	Валюты.Представление КАК ВалютаПредставление
		|ИЗ
		|	Справочник.Валюты КАК Валюты";
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		// ОписаниеКассовойСмены.НаличностьВКассе    = Выборка.НаличностьВКассе;
		ОписаниеКассовойСмены.Валюта              = Выборка.Валюта;
		ОписаниеКассовойСмены.ВалютаПредставление = Выборка.ВалютаПредставление;
		
	КонецЕсли;
	
	Возврат ОписаниеКассовойСмены;
	
КонецФункции // ПолучитьСостояниеКассовойСмены()

// Функция возвращает структуру, характеризующую состояние кассовой смены на дату.
//
Функция ПолучитьРеквизитыКассовойСменыНаДату(Касса, ДатаВремя) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассоваяСмена.Номер КАК НомерКассовойСмены,
	|	КассоваяСмена.Ссылка КАК КассоваяСмена,
	|	КассоваяСмена.СтатусыКассовойСмены КАК СтатусыКассовойСмены,
	|	КассоваяСмена.Касса КАК Касса,
	|	КассоваяСмена.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА КассоваяСмена.СтатусыКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СменаОткрыта,
	|	ВЫБОР
	|		КОГДА КассоваяСмена.СтатусыКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|			ТОГДА КассоваяСмена.НачалоКассовойСмены
	|		ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены
	|	КОНЕЦ КАК ДатаИзмененияСтатуса,
	|	ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаОстаток, 0) КАК НаличностьВКассе
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА КассоваяСмена.СтатусыКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|					ТОГДА КассоваяСмена.НачалоКассовойСмены
	|				ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены
	|			КОНЕЦ) КАК ДатаИзмененияСтатуса,
	|		КассоваяСмена.Касса КАК Касса
	|	ИЗ
	|		Документ.КассоваяСмена КАК КассоваяСмена
	|	ГДЕ
	|		КассоваяСмена.Проведен
	|		И КассоваяСмена.Касса = &Касса
	|		И ВЫБОР
	|				КОГДА КассоваяСмена.СтатусыКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|					ТОГДА КассоваяСмена.НачалоКассовойСмены
	|				ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены
	|			КОНЕЦ <= &ДатаВремя
	|	
	|	СГРУППИРОВАТЬ ПО
	|		КассоваяСмена.Касса) КАК КассовыеСмены
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КассоваяСмена КАК КассоваяСмена
	|		ПО КассовыеСмены.Касса = КассоваяСмена.Касса
	|			И (КассоваяСмена.Проведен)
	|			И (КассовыеСмены.ДатаИзмененияСтатуса = ВЫБОР
	|				КОГДА КассоваяСмена.СтатусыКассовойСмены = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|					ТОГДА КассоваяСмена.НачалоКассовойСмены
	|				ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредства.Остатки(&ДатаВремя, БанковскийСчетКасса = &Касса) КАК ДенежныеСредстваОстатки
	|		ПО КассовыеСмены.Касса = ДенежныеСредстваОстатки.БанковскийСчетКасса";
	
	Запрос.УстановитьПараметр("Касса", Касса);
	Запрос.УстановитьПараметр("ДатаВремя", ДатаВремя);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ОписаниеКассовойСмены = ПолучитьСтруктуруОписанияКассовойСмены();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОписаниеКассовойСмены, Выборка);
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ДенежныеСредстваВКассахОстатки.СуммаОстаток, 0) КАК НаличностьВКассе
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства.Остатки(, БанковскийСчетКасса = &Касса) КАК ДенежныеСредстваВКассахОстатки";
		
		Запрос.УстановитьПараметр("Касса", Касса);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ОписаниеКассовойСмены.НаличностьВКассе    = Выборка.НаличностьВКассе;
		ОписаниеКассовойСмены.Валюта              = Константы.ВалютаУчета;
		// ОписаниеКассовойСмены.ВалютаПредставление = Выборка.ВалютаПредставление;
		
	КонецЕсли;
	
	Возврат ОписаниеКассовойСмены;
	
КонецФункции // ПолучитьРеквизитыКассовойСменыНаДату()

// Функция получает открытую кассовую смену по Кассе ККМ в заданный период.
// Используется для контроля пересечения кассовых смен.
// За один период может одновременно существовать только одна кассовая смена.
//
Функция ПолучитьОткрытуюКассовуюСмену(Касса, КассоваяСмена = Неопределено, НачалоКассовойСмены, ОкончаниеКассовойСмены) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассоваяСмена.Ссылка
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.НачалоКассовойСмены <= &НачалоКассовойСмены
	|	И ВЫБОР
	|			КОГДА КассоваяСмена.ОкончаниеКассовойСмены = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены >= &НачалоКассовойСмены
	|		КОНЕЦ
	|	И КассоваяСмена.Касса = &Касса
	|	И КассоваяСмена.Ссылка <> &КассоваяСмена
	|	И КассоваяСмена.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассоваяСмена.Ссылка
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	&ОкончаниеКассовойСмены <> ДАТАВРЕМЯ(1, 1, 1)
	|	И КассоваяСмена.НачалоКассовойСмены <= &ОкончаниеКассовойСмены
	|	И ВЫБОР
	|			КОГДА КассоваяСмена.ОкончаниеКассовойСмены = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены >= &ОкончаниеКассовойСмены
	|		КОНЕЦ
	|	И КассоваяСмена.Касса = &Касса
	|	И КассоваяСмена.Ссылка <> &КассоваяСмена
	|	И КассоваяСмена.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассоваяСмена.Ссылка
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	&ОкончаниеКассовойСмены = ДАТАВРЕМЯ(1, 1, 1)
	|	И КассоваяСмена.НачалоКассовойСмены >= &НачалоКассовойСмены
	|	И КассоваяСмена.Касса = &Касса
	|	И КассоваяСмена.Ссылка <> &КассоваяСмена
	|	И КассоваяСмена.Проведен";
	
	Запрос.УстановитьПараметр("Касса",               	Касса);
	Запрос.УстановитьПараметр("НачалоКассовойСмены",    НачалоКассовойСмены);
	Запрос.УстановитьПараметр("ОкончаниеКассовойСмены", ОкончаниеКассовойСмены);
	Запрос.УстановитьПараметр("КассоваяСмена",          КассоваяСмена);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ПолучитьОткрытуюКассовуюСмену()

//////////////////////////////////////////////////////////////////////////////
// ПРОЧЕЕ
    
// Возвращает сумму документа с учетом НДС
//
// Параметры:
// Запасы          - тч документа для подсчета суммы документа
// ЦенаВключаетНДС - Признак включения НДС в цену документа
//
// Возвращаемое значение:
// Число
// Сумма документа с учетом НДС
//
Функция ПолучитьСуммуДокумента(Знач Запасы, Знач ЦенаВключаетНДС) Экспорт
	
	СуммаДокумента = Запасы.Итог("Сумма");
	
	Если Не ЦенаВключаетНДС Тогда
		СуммаДокумента = СуммаДокумента + Запасы.Итог("СуммаНДС");
	КонецЕсли;
	
	Возврат СуммаДокумента;
	
КонецФункции // ПолучитьСуммуДокумента()

// Функция - Проверить использование ф рв кассе
//
// Параметры:
//  Касса	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПроверитьИспользованиеФРвКассе(Касса, РабочееМесто = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(РабочееМесто) Тогда
		РабочееМесто = ПараметрыСеанса.РабочееМестоКлиента;
	КонецЕсли;
	
	Возврат МенеджерОборудованияВызовСервера.ПроверитьИспользованиеФРвКассе(Касса, РабочееМесто);
	
КонецФункции

#КонецОбласти

#КонецЕсли
